import pandas as pd;
import matplotlib.pyplot as plt;
s = pd.Series(data = [10, 5, 15, 20, 10], index = [1, 2, 3, 4, 5])
s.plot()
df = pd.read_csv('StudentsPerfomance.csv')

#Завдання 1
# Побудуйте гістограму для розподілу оцінок з математики (math score).


# Завдання 2
# Побудуйте box plot, щоб порівняти розподіл оцінок з математики, читання (reading score) та письма (writing score).

# Завдання 3
# Побудуйте точкову діаграму, щоб показати залежність оцінок з читання від оцінок з письма (writing score, reading score).

# Завдання 4
# Побудуйте кругову діаграму, яка показує частки чоловіків та жінок (gender) у наборі даних.

# Завдання 5
# Побудуйте стовпчикову діаграму, щоб показати кількість студентів залежно від рівня освіти їхніх батьків (parental level of education).

# Завдання 6
# Побудуйте горизонтальну стовпчикову діаграму, щоб показати кількість студентів залежно від типу обіду (lunch).

# Завдання 7
# Побудуйте лінійну діаграму, яка показує середні оцінки з математики, читання та письма по групах студентів (race/ethnicity).

# Завдання 8
# Побудуйте гістограму для оцінок з письма (writing score) для студентів, які проходили тестову підготовку (test preparation course).

# Завдання 9
# Побудуйте box plot, щоб порівняти оцінки з математики для студентів із різними типами обіду (lunch).

# Завдання 10
# Побудуйте точкову діаграму, щоб показати залежність між оцінками з математики та читання (math score, reading score), використовуючи колір для позначення статі (gender).



plt.show()